# ---------------------------------------------------------First---------------------------------------------------------
print('Задание №1\n')

def calculate_area():
    print('Выберите фигру для вычесления')
    print("1. Квадрат",
          "\n2. Прямоугольник",
          "\n3. Круг",
          "\n4. Треугольник")

    choice = input('Введите номер(от 1 до 4): ')

    if choice == '1':
        print(f"Площадь квадрата: {float(input("Введите длину стороны квадрата: ")) ** 2} квадратных единиц.")

    elif choice == '2':
        l, w = map(float, input("Введите длину и ширину прямоугольника через пробел: ").split())
        print(f"Площадь прямоугольника: {l * w} квадратных единиц.")

    elif choice == '3':
        print(f"Площадь круга: {3.14 * float(input("Введите радиус круга: ")) ** 2:.2f} квадратных единиц.")

    elif choice == '4':
        b, h = map(float, input("Введите высоту и основание треугольника через пробел: ").split())
        print(f"Площадь треугольника: {0.5 * b * h} квадратных единиц.")

    else:
        print("Неверный выбор. Пожалуйста, выберите номер от 1 до 4.")


calculate_area()


# ---------------------------------------------------------Second---------------------------------------------------------
print('\nЗадание №2\n')

array1 = [3, 1, 2]
array2 = [6, 5, 4]
array3 = [9, 8, 7]

total_summ = 0


def avg_array():
    total_summ = sum(array1 + array2 + array3)
    total_avg = total_summ / (len(array1) + len(array2) + len(array3))
    print("Общая сумма:", total_summ, "Среднее значение:", total_avg)


avg_array()
