# ---------------------------------------------------------First---------------------------------------------------------
print('Задание №1')

def hexagon_area(a):
    return (3 * (3 ** 0.5) * a ** 2) / 2
print("Площадь правильного шестиугольника равна:", hexagon_area(3.33))


# ---------------------------------------------------------Second---------------------------------------------------------
print('\nЗадание №2\n')


def rectangles_area():
    length1, width1 = map(float, input("Введите длину и ширину для прямоугольника 1 через пробел: ").split())
    length2, width2 = map(float, input("Введите длину и ширину для прямоугольника 2 через пробел: ").split())
    length3, width3 = map(float, input("Введите длину и ширину для прямоугольника 3 через пробел: ").split())

    print(f"Площадь прямоугольника 1: {length1 * width1}")
    print(f"Площадь прямоугольника 2: {length2 * width2}")
    print(f"Площадь прямоугольника 3: {length3 * width3}")

rectangles_area()