numbers = [12, 5, 8, 21, 34, 7, 18, 9, 4]
max_even = [i for i in numbers if i % 2 == 0]
if max_even:
    print("Наибольший четный элемент списка:", max(max_even))
else:
    print("В списке нет четных элементов.")

# ---------------------------------------------------------Second---------------------------------------------------------

num = sorted([i for i in numbers if i < 10])
if num:
    print("Четные числа меньше 10:", *num)
else:
    print("Четных чисел меньше 10 нет.")



