n = int(input("Введите количество элементов в массиве: "))
array = [int(input(f"Введите элемент {i}: ")) for i in range(n)]

min_abs = array[0]

for i in array:
    if abs(i) < abs(min_abs):
        min_abs = i
print("Минимальный по модулю элемент:", min_abs)
print(*array[::-1])

# ---------------------------------------------------------Second---------------------------------------------------------
print('\nЗадание №2\n')

a = [1] * 10
b = [2] * 10

print("Исходный массив A:", *a,
      "\nИсходный массив B:", *b)

a, b = b, a

print("Преобразованный массив A:", *a,
      "\nПреобразованный массив B:", *b)
